pycom/pycom-micropython-sigfox/esp32/sigfox/modsigfox.c
/*
 * Copyright (c) 2016, Pycom Limited.
 *
 * This software is licensed under the GNU GPL version 3 or any
 * later version, with permitted additional terms. For more information
 * see the Pycom Licence v1.0 document supplied with this file, or
 * available at https://www.pycom.io/opensource/licensing
 */

#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>


#include "py/mpconfig.h"
#include "py/nlr.h"
#include "py/runtime.h"
#include "py/stream.h"
#include "py/mperrno.h"
#include "mpexception.h"
#include "pybioctl.h"
#include "esp32_mphal.h"

#include "modnetwork.h"
#include "modusocket.h"
#include "sigfox/sigfox_api.h"
#include "sigfox/timer.h"
#if defined(FIPY) || defined(LOPY4)
#include "sigfox/radio_sx127x.h"
#else
#include "sigfox/radio.h"
#endif
#include "sigfox/manufacturer_api.h"
#include "sigfox/manuf_api.h"

#include "ff.h"
#include "diskio.h"
#include "sflash_diskio.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "freertos/event_groups.h"

#include "modsigfox.h"
#include "pycom_config.h"

#include "sigfox/cc112x_easy_link_reg_config.h"


#define FSK_FREQUENCY_MIN                            863000000   // Hz
#define FSK_FREQUENCY_MAX                            928000000   // Hz

#define SFX_RESET_FCC_MIN_DELAY_S                    23

extern TaskHandle_t xSigfoxTaskHndl;
#if defined(FIPY) || defined(LOPY4)
extern SemaphoreHandle_t xLoRaSigfoxSem;
#endif

Spi_t sigfox_spi = {};
sigfox_settings_t sigfox_settings = {};

sfx_u8 uplink_spectrum_access;

sigfox_obj_t sigfox_obj;

static QueueHandle_t xCmdQueue;
static QueueHandle_t xRxQueue;
static EventGroupHandle_t sigfoxEvents;

static sigfox_partial_rx_packet_t sigfox_partial_rx_packet;
static sfx_rc_t all_rcz[] = {RC1, RC2, RC3, RC4};
static uint32_t sfx_rcz_id;
static uint8_t sigfox_id_rev[4];
static sfx_rc_t sfx_rcz;

static RTC_DATA_ATTR uint32_t tx_timestamp;

STATIC sfx_u32 rcz_config_words[4][3] = {
    {0},
    RC2_SM_CONFIG,
    RC3_CONFIG,
    RC4_SM_CONFIG,
};
STATIC sfx_u32 rcz_current_config_words[3];

STATIC sfx_u32 rcz_frequencies[4][2] = {
    {868130000, 869525000},
    {902200000, 905200000},
    {923200000, 922200000},
    {920800000, 922300000},
};

static void TASK_Sigfox (void *pvParameters);

#if !defined(FIPY) && !defined(LOPY4)
static void fsk_register_config (void);
static void fsk_manual_calibration (void);
static void fsk_cc112x_tx (uint8_t *data, uint32_t len);
static void fsk_cc112x_rx (void);
static void fsk_tx_register_config(void);
static void fsk_rx_register_config(void);
#endif
static int32_t sigfox_recv (byte *buf, uint32_t len, int32_t timeout_ms);

/******************************************************************************
 DEFINE CONSTANTS
 ******************************************************************************/
#define RX_FIFO_ERROR                                 (0x11)

#define SIGFOX_CHECK_SOCKET(s)                        if (s->sock_base.u.sd < 0) {  \
                                                          *_errno = MP_EBADF;       \
                                                          return -1;                \
                                                      }

#define SIGFOX_SOCKET_GET_FD(sd)                      (sd & 0xFF)

#define SIGFOX_SOCKET_SET_RX(sd, rx)                  (sd &= 0xFFFF00FF); \
                                                      (sd |= (rx << 8))

#define SIGFOX_SOCKET_GET_RX(sd)                      ((sd >> 8) & 0xFF)

#define SIGFOX_SOCKET_SET_TX_REPEAT(sd, tx_repeat)    (sd &= 0xFF00FFFF); \
                                                      (sd |= (tx_repeat << 16))

#define SIGFOX_SOCKET_GET_TX_REPEAT(sd)               ((sd >> 16) & 0xFF)

#define SIGFOX_SOCKET_SET_OOB(sd, oob)                (sd &= 0xF0FFFFFF); \
                                                      (sd |= (oob << 24))

#define SIGFOX_SOCKET_GET_OOB(sd)                     ((sd >> 24) & 0x0F)

#define SIGFOX_SOCKET_SET_BIT(sd, bit)                (sd &= 0x0FFFFFFF); \
                                                      (sd |= (bit << 28))

#define SIGFOX_SOCKET_GET_BIT(sd)                     ((sd >> 28) & 0x0F)

enum {
    E_MODSIGOFX_TEST_MODE_START_CW = SFX_TEST_MODE_TX_SYNTH + 1,
    E_MODSIGOFX_TEST_MODE_STOP_CW,
    E_MODSIGOFX_TEST_MODE_MANUAL_TX
};

/******************************************************************************
 DEFINE PUBLIC FUNCTIONS
 ******************************************************************************/
void modsigfox_init0 (void) {
    xCmdQueue = xQueueCreate(SIGFOX_CMD_QUEUE_SIZE_MAX, sizeof(sigfox_cmd_data_t));
    xRxQueue = xQueueCreate(SIGFOX_DATA_QUEUE_SIZE_MAX, sizeof(sigfox_rx_data_t));
    sigfoxEvents = xEventGroupCreate();

    TIMER_downlinnk_timer_create();
    TIMER_carrier_sense_timer_create();
#if !defined(FIPY) && !defined(LOPY4)
    TIMER_RxTx_done_timer_create();
#endif

    MANUF_API_nvs_open();

    // there is only One block of memory to allocate
    Table_200bytes.memory_ptr = (sfx_u8 *)(DynamicMemoryTable) ;
    Table_200bytes.allocated = SFX_FALSE;

#if !defined(FIPY) && !defined(LOPY4)
    // setup the CC1125 control RESET pin
    gpio_config_t gpioconf = {.pin_bit_mask = 1 << 18,
                              .mode = GPIO_MODE_OUTPUT,
                              .pull_up_en = GPIO_PULLUP_DISABLE,
                              .pull_down_en = GPIO_PULLDOWN_DISABLE,
                              .intr_type = GPIO_INTR_DISABLE};
    gpio_config(&gpioconf);
    GPIO_REG_WRITE(GPIO_OUT_W1TS_REG, 1 << 18);
    SpiInit( &sigfox_spi, RADIO_MOSI, RADIO_MISO, RADIO_SCLK, RADIO_NSS );
#endif

    xTaskCreatePinnedToCore(TASK_Sigfox, "Sigfox", SIGFOX_STACK_SIZE, NULL, SIGFOX_TASK_PRIORITY, &xSigfoxTaskHndl, 1);
}

void sigfox_update_id (void) {
    #define SFX_ID_PATH          "/flash/sys/sfx.id"

    FILINFO fno;

    if (FR_OK == f_stat(SFX_ID_PATH, &fno)) {
        FIL fp;
        f_open(&fp, SFX_ID_PATH, FA_READ);
        UINT sz_out;
        uint8_t id[4];
        FRESULT res = f_read(&fp, id, sizeof(id), &sz_out);
        if (res == FR_OK) {
            if (config_set_sigfox_id(id)) {
                mp_hal_delay_ms(250);
                ets_printf("SFX ID write OK\n");
            } else {
                res = FR_DENIED;    // just anything different than FR_OK
            }
        }
        f_close(&fp);
        if (res == FR_OK) {
            // delete the mac address file
            f_unlink(SFX_ID_PATH);
        }
    }
}

