pycom/pycom-micropython-sigfox/esp32/sigfox/modsigfox.c
void sigfox_update_pac (void) {
    #define SFX_PAC_PATH          "/flash/sys/sfx.pac"

    FILINFO fno;

    if (FR_OK == f_stat(SFX_PAC_PATH, &fno)) {
        FIL fp;
        f_open(&fp, SFX_PAC_PATH, FA_READ);
        UINT sz_out;
        uint8_t pac[8];
        FRESULT res = f_read(&fp, pac, sizeof(pac), &sz_out);
        if (res == FR_OK) {
            if (config_set_sigfox_pac(pac)) {
                mp_hal_delay_ms(250);
                ets_printf("SFX PAC write OK\n");
            } else {
                res = FR_DENIED;    // just anything different than FR_OK
            }
        }
        f_close(&fp);
        if (res == FR_OK) {
            // delete the mac address file
            f_unlink(SFX_PAC_PATH);
        }
    }
}

void sigfox_update_private_key (void) {
    #define SFX_PRIVATE_KEY_PATH          "/flash/sys/sfx_private.key"

    FILINFO fno;

    if (FR_OK == f_stat(SFX_PRIVATE_KEY_PATH, &fno)) {
        FIL fp;
        f_open(&fp, SFX_PRIVATE_KEY_PATH, FA_READ);
        UINT sz_out;
        uint8_t key[16];
        FRESULT res = f_read(&fp, key, sizeof(key), &sz_out);
        if (res == FR_OK) {
            if (config_set_sigfox_private_key(key)) {
                mp_hal_delay_ms(250);
                ets_printf("SFX private key write OK\n");
            } else {
                res = FR_DENIED;    // just anything different than FR_OK
            }
        }
        f_close(&fp);
        if (res == FR_OK) {
            // delete the mac address file
            f_unlink(SFX_PRIVATE_KEY_PATH);
        }
    }
}

void sigfox_update_public_key (void) {
    #define SFX_PUBLIC_KEY_PATH          "/flash/sys/sfx_public.key"

    FILINFO fno;

    if (FR_OK == f_stat(SFX_PUBLIC_KEY_PATH, &fno)) {
        FIL fp;
        f_open(&fp, SFX_PUBLIC_KEY_PATH, FA_READ);
        UINT sz_out;
        uint8_t key[16];
        FRESULT res = f_read(&fp, key, sizeof(key), &sz_out);
        if (res == FR_OK) {
            if (config_set_sigfox_public_key(key)) {
                mp_hal_delay_ms(250);
                ets_printf("SFX public key write OK\n");
            } else {
                res = FR_DENIED;    // just anything different than FR_OK
            }
        }
        f_close(&fp);
        if (res == FR_OK) {
            // delete the mac address file
            f_unlink(SFX_PUBLIC_KEY_PATH);
        }
    }
}

/******************************************************************************
 DEFINE PRIVATE FUNCTIONS
 ******************************************************************************/

static uint32_t modsigfox_api_init (void) {
    if (sigfox_obj.state != E_SIGFOX_STATE_NOINIT) {
        SIGFOX_API_close();
        sigfox_obj.state = E_SIGFOX_STATE_NOINIT;
    }

    if (SIGFOX_API_open(&sfx_rcz, sigfox_id_rev) != SFX_ERR_NONE) {
        return SIGFOX_STATUS_ERR;
    }

    if (sfx_rcz_id != E_SIGFOX_RCZ1) {
        if (SFX_ERR_NONE != SIGFOX_API_set_std_config(rcz_config_words[sfx_rcz_id], false)) {
            return SIGFOX_STATUS_ERR;
        }

        if (sfx_rcz_id == E_SIGFOX_RCZ2 || sfx_rcz_id == E_SIGFOX_RCZ4) {
            SIGFOX_API_reset();
        }
        memcpy(rcz_current_config_words, rcz_config_words[sfx_rcz_id], sizeof(rcz_current_config_words));
    }
    return SFX_ERR_NONE;
}

static sfx_error_t modsigfox_sfx_send(sigfox_cmd_rx_data_t *cmd_rx_data, sigfox_rx_data_t *rx_data) {
#if defined(FIPY) || defined(LOPY4)
    xSemaphoreTake(xLoRaSigfoxSem, portMAX_DELAY);
#endif
    uint32_t now = mp_hal_ticks_s();
    sfx_error_t sfx_error;

    if (sfx_rcz_id == E_SIGFOX_RCZ2 || sfx_rcz_id == E_SIGFOX_RCZ4) {
        sfx_u8 info;
        if (SFX_ERR_NONE == SIGFOX_API_get_info(&info)) {
            if ((info & 0b00001111) || !(info & 0b11110000)) {   // FCC channel not default or no free micro-channels on the default one
                SIGFOX_API_reset();    // Need to reset the Sigfox API in order to return to the default channel
                int32_t tx_delay = now - tx_timestamp;
                if (tx_timestamp > 0) {
                    // We must wait in order to respect FCC regulations
                    if (tx_delay >= 0 && tx_delay < SFX_RESET_FCC_MIN_DELAY_S) {
                        vTaskDelay(((SFX_RESET_FCC_MIN_DELAY_S - tx_delay) * 1000) / portTICK_RATE_MS);
                    }
                }
            }
        } else {
            // reset anyway in order to return to the default channel
            SIGFOX_API_reset();
        }
    }

    tx_timestamp = now;     // save the current timestamp

#if defined(FIPY)
    RADIO_warm_up_crystal(rcz_frequencies[sfx_rcz_id][0]);
#endif

    if (cmd_rx_data->cmd_u.info.tx.oob) {
        sfx_error =  SIGFOX_API_send_outofband();
        goto end_send;
    } else {
        if (cmd_rx_data->cmd_u.info.tx.len > 0) {
            sfx_error =  SIGFOX_API_send_frame(cmd_rx_data->cmd_u.info.tx.data, cmd_rx_data->cmd_u.info.tx.len, rx_data->data,
                                         cmd_rx_data->cmd_u.info.tx.tx_repeat, cmd_rx_data->cmd_u.info.tx.receive);
            goto end_send;
        }
        sfx_error = SIGFOX_API_send_bit(cmd_rx_data->cmd_u.info.tx.data[0] ? SFX_TRUE : SFX_FALSE,
                                   rx_data->data, cmd_rx_data->cmd_u.info.tx.tx_repeat,
                                   cmd_rx_data->cmd_u.info.tx.receive);
        goto end_send;
    }
end_send:
#if defined(FIPY) || defined(LOPY4)
    RADIO_reset_registers();
    xSemaphoreGive(xLoRaSigfoxSem);
#endif
    return sfx_error;
}

static void TASK_Sigfox(void *pvParameters) {
    sigfox_cmd_rx_data_t cmd_rx_data;

    for ( ; ; ) {
        vTaskDelay(2 / portTICK_RATE_MS);

        switch (sigfox_obj.state) {
        case E_SIGFOX_STATE_NOINIT:
        case E_SIGFOX_STATE_IDLE:
        case E_SIGFOX_STATE_RX:
        case E_SIGFOX_STATE_TEST:
            if (xQueueReceive(xCmdQueue, &cmd_rx_data, 0)) {
                switch (cmd_rx_data.cmd_u.cmd) {
                case E_SIGFOX_CMD_INIT:
                    {
                        uint32_t status = SIGFOX_STATUS_COMPLETED;
                     #if !defined(FIPY) && !defined(LOPY4)
                        TIMER_RxTx_done_stop();   // stop the RxTx timer while reconfiguring
                     #endif
                        if (cmd_rx_data.cmd_u.info.init.mode == E_SIGFOX_MODE_SIGFOX) {
                            sfx_rcz_id = cmd_rx_data.cmd_u.info.init.rcz;
                            memcpy(&sfx_rcz, &all_rcz[cmd_rx_data.cmd_u.info.init.rcz], sizeof(sfx_rcz));
                            uplink_spectrum_access = sfx_rcz.spectrum_access;

                            uint8_t sigfox_id[4];
                            config_get_sigfox_id(sigfox_id);
                            // the Sigfox ID must be passed to API_open in reverse order
                            for (int i = 0; i < sizeof(sigfox_id); i++) {
                                sigfox_id_rev[3 - i] = sigfox_id[i];
                            }

                            status |= modsigfox_api_init();
                        } else {
                        #if !defined(FIPY) && !defined(LOPY4)
                            // write radio registers
                            fsk_register_config();
                            // calibrate radio according to errata
                            fsk_manual_calibration();
                        #endif
                        }
                        sigfox_obj.mode = cmd_rx_data.cmd_u.info.init.mode;
                        sigfox_obj.frequency = cmd_rx_data.cmd_u.info.init.frequency;
                        sigfox_obj.state = E_SIGFOX_STATE_IDLE;
                        xEventGroupSetBits(sigfoxEvents, status);
                    }
                    break;
                case E_SIGFOX_CMD_TX:
                    {
                        if (sigfox_obj.mode == E_SIGFOX_MODE_SIGFOX) {
                            sigfox_rx_data_t rx_data = {.len = SIGFOX_RX_PAYLOAD_SIZE_MAX};
                            uint32_t status = SIGFOX_STATUS_COMPLETED;

                            sfx_error_t err = modsigfox_sfx_send(&cmd_rx_data, &rx_data);

                            if (err == SFX_ERR_NONE) {
                                if (cmd_rx_data.cmd_u.info.tx.receive) {
                                    xQueueSend(xRxQueue, (void *)&rx_data, 0);
                                }
                            } else {
                                if (err == SFX_ERR_SEND_FRAME_INVALID_FH_CHAN
                                    || err == SFX_ERR_SEND_BIT_INVALID_FH_CHAN
                                    || err == SFX_ERR_SEND_FRAME_STATE
                                    || err == SFX_ERR_SEND_BIT_STATE
                                    || err == SFX_ERR_SEND_OOB_STATE) {
                                    // try again...
                                    modsigfox_api_init();
                                    err = modsigfox_sfx_send(&cmd_rx_data, &rx_data);
                                    if (SFX_ERR_NONE == err) {
                                        if (cmd_rx_data.cmd_u.info.tx.receive) {
                                            xQueueSend(xRxQueue, (void *)&rx_data, 0);
                                        }
                                    } else {
                                        status |= SIGFOX_STATUS_ERR;
                                    }
                                } else {
                                    status |= SIGFOX_STATUS_ERR;
                                }
                            }
                            sigfox_obj.state = E_SIGFOX_STATE_IDLE;
                            xEventGroupSetBits(sigfoxEvents, status);
                        } else {
                        #if !defined(FIPY) && !defined(LOPY4)
                            // stop the TxRx timer before reconfiguring for Tx
                            TIMER_RxTx_done_stop();
                            trxSpiCmdStrobe(CC112X_SIDLE);
                            // we must start the timer before calling fsk_cc112x_tx()
                            TIMER_RxTx_done_start();
                            fsk_cc112x_tx (cmd_rx_data.cmd_u.info.tx.data, cmd_rx_data.cmd_u.info.tx.len);
                            sigfox_obj.state = E_SIGFOX_STATE_TX;
                        #endif
                        }
                    }
                    break;
                case E_SIGFOX_CMD_TEST:
                #if defined(FIPY)
                    xSemaphoreTake(xLoRaSigfoxSem, portMAX_DELAY);
                    RADIO_warm_up_crystal(rcz_frequencies[sfx_rcz_id][0]);
                #endif
                if (cmd_rx_data.cmd_u.info.test.mode <= SFX_TEST_MODE_TX_SYNTH) {
                        SIGFOX_API_test_mode(cmd_rx_data.cmd_u.info.test.mode, cmd_rx_data.cmd_u.info.test.config);
                    } else { // start or stop CW
                        if (cmd_rx_data.cmd_u.info.test.mode == E_MODSIGOFX_TEST_MODE_START_CW) {
                            RADIO_start_unmodulated_cw (cmd_rx_data.cmd_u.info.test.config);
                        } else if (cmd_rx_data.cmd_u.info.test.mode == E_MODSIGOFX_TEST_MODE_STOP_CW) {
                            RADIO_stop_unmodulated_cw (cmd_rx_data.cmd_u.info.test.config);
                        } else {
                            for (int i = 0; i < 20; i++) {
                                uint8_t tx_frame[18] = { 0xAA, 0xAA, 0xA3, 0x5F, 0x8D, 0xC3, 0x74, 0x7D, 0x18,
                                                         0x00, 0xAA, 0xAA, 0xB8, 0x01, 0x5A, 0x5F, 0x53, 0x4C };
                                MANUF_API_rf_init(SFX_RF_MODE_TX);
                                MANUF_API_change_frequency(cmd_rx_data.cmd_u.info.test.config);
                                MANUF_API_rf_send(tx_frame, sizeof(tx_frame));
                                vTaskDelay(50 / portTICK_RATE_MS);
                            }
                        }
                    }
                    sigfox_obj.state = E_SIGFOX_STATE_TEST;
                    xEventGroupSetBits(sigfoxEvents, SIGFOX_STATUS_COMPLETED);
                #if defined(FIPY) || defined(LOPY4)
                    RADIO_reset_registers();
                    xSemaphoreGive(xLoRaSigfoxSem);
                #endif
                    break;
                default:
                    break;
                }
            }
        #if !defined(FIPY) && !defined(LOPY4)
            else {
                if (sigfox_obj.state == E_SIGFOX_STATE_IDLE) {
                    // set radio in RX
                    fsk_rx_register_config();
                    RADIO_change_frequency(sigfox_obj.frequency);
                    trxSpiCmdStrobe(CC112X_SRX);
                    sigfox_obj.state = E_SIGFOX_STATE_RX;
                    TIMER_RxTx_done_start();
                } else if (sigfox_obj.state == E_SIGFOX_STATE_RX) {
                    fsk_cc112x_rx();
                }
            }
        #endif
            break;
    #if !defined(FIPY) && !defined(LOPY4)
        case E_SIGFOX_STATE_TX:
            // wait for interrupt that packet has been sent (assumes the GPIO
            // connected to the radioRxTxISR function is set to GPIOx_CFG = 0x06)
            if (packetSemaphore == ISR_IDLE) {
                uint8 volatile readByte;
                // read the datarate from the registers
                cc112xSpiReadReg(CC112X_MARCSTATE, (uint8 *)&readByte, 1);
            } else {
                trxSpiCmdStrobe(CC112X_SIDLE);
                sigfox_obj.state = E_SIGFOX_STATE_IDLE;
                xEventGroupSetBits(sigfoxEvents, SIGFOX_STATUS_COMPLETED);
            }
            break;
    #endif
        default:
            break;
        }
    }
}

#if !defined(FIPY) && !defined(LOPY4)
static void fsk_cc112x_tx (uint8_t *data, uint32_t len) {
    uint8 packet[FSK_TX_PAYLOAD_SIZE_MAX + 4];

    // clear the semaphore flag
    packetSemaphore = ISR_IDLE;

    fsk_tx_register_config();

    RADIO_change_frequency(sigfox_obj.frequency);

    // Write packet to tx fifo
    packet[0] = len;
    memcpy(&packet[1], data, len);
    packet[len + 1] = 0;

    cc112xSpiWriteTxFifo(packet, len + 1);

    // strobe TX to send packet
    trxSpiCmdStrobe(CC112X_STX);
}

static void fsk_cc112x_rx (void) {
    sigfox_rx_data_t rx_data;
    uint8_t rx_last, status;
    uint8_t rxlastindex;

    // wait for the packet received interrupt
    if (packetSemaphore == ISR_ACTION_REQUIRED) {

        /* IMPORTANT : using the register CC112X_NUM_RXBYTES gives wrong values concerning the packet length
         * DO NOT USE THIS REGISTER, use RXLAST instead which give the last index in the RX FIFO
         * and flush the FIFO after reading it   */
        rxlastindex = 0;

        // Read 10 times to get around a bug
        for (int i = 0; i < 10; i++) {
            cc112xSpiReadReg(CC112X_RXLAST, &rx_last, 1);
            rxlastindex |= rx_last;
        }

